using uLearn;

namespace OOP.Slides.U04_UI
{
	[Slide("Введение", "C59324B359B246C6AAE5F75E214275B3")]
	public class S010_Intro
	{
		/*
		Этот блок задач вы можете выполнять по выбору либо на C#, либо на Java.

		В области создания пользовательских интерфейсов присутствует множество проблем, 
		которые успешно решаются с помощью ООП. Вот их мы и рассмотрим в этом блоке.

		Первая, лежащая на поверхности проблема, которую нужно было решить — это дублирование кода.
		Одинаковые элементы интерфейса встречаются в совершенно разных программах
		поэтому естественным шагом было создания библиотеки повторно используемых 
		элементов управления (контролов). И для .NET и для Java существует несколько независимых библиотек контролов.

		В .NET предлагается знакомиться с концепциями проектирования UI на примере System.Windows.Forms.
		Это одновременно название и сборки, которую нужно подключить к проекту, 
		чтобы воспользоваться готовыми контролами, и пространство имен,
		в котором определены соответствующие классы.
		Базовое представление об этой библиотеке можно получить из этого 
		[туториала](http://msdn.microsoft.com/ru-ru/library/dd492135.aspx).
		

		В Java — с использованием стандартной библиотеки swing. 
		Небольшой курс знакомства со swing можно найти тут: http://zetcode.com/tutorials/javaswingtutorial/
		*/

	}
}