using uLearn;

namespace OOP.Slides.U04_UI
{
	[Slide("Layout", "887CBC234EBB4AF5825BB4C57815ADEE")]
	public class S020_Layouts
	{
		/*
		Чуть менее очевидная, но всё ещё лежащая на поверхности задача — 
		избавление от дублирования кода, отвечающего за правильное расположение 
		контролов в окне и их поведение при изменении размеров окна, 
		размеров системного шрифта и т.п.

		В Windows Forms с самого начала был встроен механизм якорей и стыковки 
		— свойства Anchor и Dock у любого контрола. 
		
		Якоря (anchors) позволяют зафиксировать расстояние от границы контрола 
		до границы родительского контрола (например самого окна).
		С помощью них можно делать элементы управления выравненные по нижнему или правому краю окна.

		Dock позволяет задать способ заполнения свободного пространства контролом. 
		Так можно делать растягивающиеся элементы управления.

		В Java swing для этого используются LayoutManager-ы. 
		Они чуть сложнее в использовании, но предоставляют более широкие возможности.
		Каждый конкретный LayoutManager реализует свой алгоритм выравнивания 
		и расположения добавленных в него контролов. 
		Сложный интерфейс реализуется комбинированием нескольких LayoutManager-ов.

		Позже в .NET Windows Forms также появились аналоги LayoutManager-ов 
		— SplitContainer, TableLayout, FlowLayout.
		*/

	}
}