using uLearn;

namespace OOP.Slides.U11_AI
{
	[Slide("Задача: ИИ лесного жителя", "E157044B9F9A4E3BBB17DAAA90FF5FAC")]
	public class S010_AI
	{

		/*
		В отдельном классе реализуйте игрового бота, управляющего лесным жителем. 
		Задача бота как можно дойти до цели — заранее определенной точки леса. 
		Если у игрока заканчиваются жизни — задача считается проваленной.

		Доработать класс леса так, чтобы при создании лесного жителя можно было указать для него цель.

		Для перемещения боту нужно вызывать метод Move леса, передав свое имя и направление движения.
		Бот ничего не знает о карте леса (туман войны) и ориентируется только по ответам метода Move.

		Создайте несколько тестовых карт. Создайте тесты, проверяющие, что бот успешно доходит до цели в этих картах.
		
		### Рекомендации по проектированию алгоритма ИИ
		
		* Стройте игровое поле по мере перемещения. Это поможет не ходить несколько раз по одному и тому же месту.
		* Лабиринт может быть большим, поэтому не забывайте своевременно пополнять запасы жизней и не засиживаться на капканах.
		* Можете упростить себе задачу, считая, что граф дорог в лесу не содержит циклов. 
		В этом случае можно применить простые эвристики выхода из лабиринта.

		*/
	}
}