namespace uLearn.Courses.BasicProgramming.Slides.U03_Cycles
{
	[Slide("Практика", "{D79D448F-B8B6-4D8B-BDD4-84BB35528C5A}")]
	class S099_Exercise
	{
		/*
		[Скачать проекты с задачами](loops.zip)

		Разминка
		---
		Для введенного с консоли числа:

		* Выведите все его делители по одному разу. 
		* Для каждого делителя, найдите максимальную степень, в которую его можно возвести, чтобы он остался делителем.

		Решите задачу в отдельном консольном проекте.

		Лабиринты
		---
		1. Откройте и изучите проект Mazes. Там заготовлены несколько фиксированных лабиринтов.
		2. В каждом лабиринте вам нужно довести робота до выхода — клетки, помеченной зеленым кружком.
		3. Для этого реализуйте пустые методы в классе MazeTasks. Используйте методы объекта robot, для его перемещения.

		Подсказки:

		* Не нужно писать код выхода из произвольного лабиринта. Напишите, решение для конкретных лабиринтов.
		* Используйте циклы. Ваш К.О.
		* Постарайтесь решить задачу с ограничение "не более одного цикла на метод".
		* Подумайте, какие вспомогательные методы помогут сделать ваше решение более лаконичным, понятным и красивым.


		*/
	}
}
