using System;
using uLearn;

namespace OOP.Slides.U02_Polymorphism
{
	[Slide("Полиморфизм. Рабочие записки", "{B70292B6-D84B-4C63-B189-700AD235E1BE}}")]
	public class S010_Polymorphism
	{
		/*
		1. Сделать общий интерфейс для обоих алгоритмов навигации робота. Переписать тестирующий код без if-ов.

		2. Добавить в модель шумы. Передавать в конструктор робота интерфейс для добавления "шума" — то, на с какой скоростью на самом деле будет двигаться робот, в завимисости от управляющих значений.
		Демонстрация шаблона стратегия на примере шумов.
 		Доработка алгоритмов, чтобы они могли работать в условиях шумов. Тестирование с разными профилями шумов. Один из профилей — отсутствие шумов — демонстрирует идею NullObject.

		3. Объединение MaxVelocity, MaxAngularVelocity и генератора шумов в один объект "ФизикаРобота". Введение этого объекта упростит конструктор робота и метод Move.
		На этом примере рассмотреть способ борьбы с большим количеством аргументов через объединение связанных аргументов во вспомогательные смысловые классы.
		*/
	}
}