using uLearn;

namespace OOP.Slides.U02_Polymorphism
{
	[Slide("Задача: Обобщенный навигатор", "{B70292B6-D84B-4C63-B189-700AD235E1BE}}")]
	public class S010_IRobotNavigator
	{
		/*
		Это обязательная задача.

		При сравнении двух навигаторов у вас неизбежно должен был появиться дублирующийся код — одна версия работает с `SimpleNavigator`, вторая — с `SmartNavigator`.
		От этого дублирования легко избавиться, если ввести интерфейс `IRobotNavigator` и реализовать его в классах навигаторов. Сделайте это!
		
		Подумайте, что должно войти в интерфейс `IRobotNavigator`, чтобы у вас в коде, измеряющем эффективность навигаторов не осталось завязок на конкретные навигаторы.
		*/
	}
}