/*
 * Студенты могут бесплатно получить Visual Studio через http://dreamspark.ru
 * 
 * Вы также можете использовать Xamarin Studio (http://xamarin.com) - альтернативную среду разработки на C#. 
 * В отличие от Visual Studio, Xamarin работает и с другими операционными системами. 
 * 
 * Программы под .NET, благодаря технологии mono, запускаются под Linux и OSX, а также на мобильных устройствах
 * 
 * Кодовый файл - это один из файлов на языке C#.
 * Проект - это совокупность кодовых файлов, которые могут быть скомпилированы в сборку: программу или библиотеку
 * Решение (solution) - это несколько проектов, объединенные общими библиотеками и задачами
 * Reference - ссылка внутри проекта на другие сборки, которые позволяют использовать сторонний код
 * 
 * Метод - это последовательность действий.
 * Класс - это совокупность данных и методов. Все сборки состоят из скомпилированных классов.
 * Пространство имен - это совокупность классов, логически связанных между собой. 
 * 
 * Между сборками и пространствами имен нет прямого соответствия: в сборке может хранится несколько пространств имен, 
 * а разные классы одного пространства имен могут быть определены в разных сборках.
 */

//Таким образом вы подключаете пространство имен System к вашему кодовому файлу (не к всему проекту! Это не Reference!)
using System;

//Таким образом вы определяете свое пространство имен
namespace Lectures
{
    //Таким образом определяется класс
    class Program
    {
        /*
         * static - некое волшебное слово, смысл которого будет ясен позднее.
         * void Main() определяет метод.
         * Из-за своего названия Main является точкой входа - это метод, который будет запущен при выполнении программы
         */
        static void MainX()
        {
            //Этот код выводит на экран строку
            //Console - это класс, также как Program, определенный в пространстве имен System
            Console.WriteLine("Hello, world!");
        }
    }
}
