namespace uLearn.Courses.BasicProgramming.Slides.U06_AutomaticTesting
{
	[Slide("Test Driven Development", "{D73D0E96-E4C7-4817-B96E-434E8A4ABEF9}")]
	class S060_Tdd
	{
		//#video bWh_1RZnL7E

		/*
		## Заметки по лекции

		Уточнение к видео.

		Часто роли аналитика-проектировщика и программиста совмещаются. В этом случае программист сам формулирует тесты, а затем пишет код, который соответствует этим тестам.
		
		Различные исследования показывают, что написание тестов до написания кода приводят к более качественным программам, по сравнению с более привычным подходом, когда тесты пишутся в конце.

		Чуть более подробно про TDD можно прочитать 
		[в Википедии](https://ru.wikipedia.org/wiki/%D0%A0%D0%B0%D0%B7%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%BA%D0%B0_%D1%87%D0%B5%D1%80%D0%B5%D0%B7_%D1%82%D0%B5%D1%81%D1%82%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5)

		*/
	}
}
