using uLearn;

namespace OOP.Slides.U01_DataTypes_And_Algorithms
{
	[Slide("Задача 'Angle'", "{740C699A-B9B1-40F1-A108-6AA1E8484F6E}")]
	public class S035_AngleTask
	{
		/*
		Выполняйте эту задачу в том же проекте, что и предыдущую.

		По аналогии с классом Vector создайте класс Angle, со следующими членами класса:
		
		* методы Add и Subtract для сложения и вычитания углов.
		* свойство Radians, возвращающее значение угла в радианах в диапазоне (-PI..PI]
		* конструктор класса, создающий Angle по значению угла в радианах.
		* конструктор класса, создающий Angle из вектора.
		
		Хорошо подумайте, где именно в классе Angle лучше реализовать контроль инварианта "Radians всегда в диапазоне (-PI..PI]".

		Напишите тест, проверящий, что в результате любых операций Radians всегда остается в заданном диапазоне.
		При создании тестов не забудте про проверку корректности на различных граничных случаях: ноль, очень большие или очень маленькие числа.
		*/
	}
}