using uLearn;

namespace OOP.Slides.U01_DataTypes_And_Algorithms
{
	[Slide("Задача 'ToString и Equals'", "{F4570C1E-C341-400E-8A68-FF6F3EFAFC76}")]
	public class S040_ToStringEqualsTask
	{
		/*
		Обычно люди ожидают, что если что-то выглядит как тип данных, то его экземпляры можно сравнивать как значения.
		Например, логично ожидать, что Equals у вектора сравнивает вектора покоординатно.

		Однако, по умолчанию Equals сравнивает объекты по ссылкам, а не по значениям. 
		Поэтому для типов данных всегда стоит переопределять метод Equals.
		
		Вместе с Equals, всегда нужно переопределять и метод GetHashCode.
		У равных объектов GetHashCode должен всегда возвращать одинаковые значения, иначе с объектами этого класса некоторые системные коллекции (например Dictionary) могут работать некорректно.

		Кроме того для удобства отладки и вывода на консоль, удобно переопределить метод ToString().
		Дело в том, что когда отладчик Visual Studio показывает вам значение переменной, он на самом деле использует для этого метод `ToString()` соответствующего объекта.

		## Задача

		Определить методы Equals, GetHashCode, ToString у классов Angle и Vector.
		*/
	}
}