using uLearn;

namespace OOP.Slides.U01_DataTypes_And_Algorithms
{
	[Slide("Задача 'Робот'", "{433A8E6B-2541-4F5D-B48C-3CF5E2604985}")]
	public class S050_RobotTask
	{
		/*
		Вот и добрались до самого интересного. Сейчас вам нужно будет смоделировать движение робота, выполненного по схеме двухколесной платформы.

		![Робот](robot.png)

		Такая схема широко используется, например, в роботах пылесосах. Кроме того она довольно распространена в различных соревнованиях по робототехнике, 
		а [на просторах интернета](https://www.google.ru/search?q=two+wheeled+robot+kit+shop) можно даже найти и купить специальные наборы для самостоятельной сборки подобных платформ.

		Управляя скоростями движения правого и левого колеса, такой робот может передвигаться вперед и назад (если угловая скорость нулевая), поворачивать на месте (если линейная скорость нулевая), 
		а также двигаться по дугам окружностей (если обе скорости не равны нулю). В каждый момент времени вы можете управлять его линейной и угловой скоростями.

		Создайте неизменяемый класс Robot со следующими свойствами:

		* Положение робота на плоскости
		* Направление робота
		* Максимальный допустимый модуль линейной скорости
		* Максимальный допустимый модуль угловой скорости
		*/
	}
}