using uLearn;

namespace OOP.Slides.U01_DataTypes_And_Algorithms
{
	[Slide("Задача 'Робот'", "{433A8E6B-2541-4F5D-B48C-3CF5E2604985}")]
	public class S050_RobotTask
	{
		/*
		Двумерный робот может передвигаться по плоскости. Он может ездить вперед-назад и поворачиваться вокруг своей оси, меняя направление.

		В каждый момент времени вы можете управлять его линейной и угловой скоростями.

		Ваша задача реализовать класс Robot, моделирующий робота.
		
		Класс должен быть неизменяемым.

		У робота должны быть следующие свойства:

		* Положение робота на плоскости
		* Направление робота
		* Максимальный допустимый модуль линейной скорости.
		* Максимальный допустимый модуль угловой скорости.
		*/
	}
}