using uLearn;

namespace OOP.Slides.U01_DataTypes_And_Algorithms
{
	[Slide("Задача 'Робот'", "{433A8E6B-2541-4F5D-B48C-3CF5E2604985}")]
	public class S050_RobotTask
	{
		/*
		Вот и добрались до самого интересного. Сейчас вам нужно будет смоделировать робота.

		Робот может передвигаться по полу вперед и назад, а также поворачиваться вокруг своей вертикальной оси, меняя направление.
		В каждый момент времени вы можете управлять его линейной и угловой скоростями.

		Создайте неизменяемый класс Robot со следующими свойствами:

		* Положение робота на плоскости
		* Направление робота
		* Максимальный допустимый модуль линейной скорости
		* Максимальный допустимый модуль угловой скорости
		*/
	}
}