using uLearn;

namespace OOP.Slides.U03_DataStructure
{
	[Slide("Структуры данных и сервисы. Рабочие записки", "{FDE53EE1-29BA-41FB-BADE-9DACB7495B42}")]
	public class S010_DataStructures
	{
		/*
		Реализовать какую-то структуру данных. Варианты: хип, LRU-set, Суффиксный массив.

		Generics, компараторы, тесты на корректность и производительность.

		Сделать над структурой данных сервис, который долго строится, занимает память, но быстро отвечает на какие-то запросы.
		Рассмотреть разделение ответственностей: сервис логгирует свои действия, мониторит занимаемую память и т.п. Структура данных ничего этого не делает.

		Нужно придумать конкретную задачу.
		*/
	}
}