using uLearn;

namespace OOP.Slides.U03_DataStructure
{
    [Slide("Задача. Сервис автодополнения", "{2315E50E-3EA0-4943-8113-E6025325EFA0}")]
    public class S060_LimitedAutocompleteService
    {
		/*
		Данная задача является обязательной.
        
		Необходимо реализовать сервис со следующими возможностями:

		* Ввести очередное слово.
		* Среди последних 10 000 _уникальных_ введенных слов, показать любые 10, которые начинаются на заданного префикса.
        
		От сервиса мы хотим понятный интерфейс, логгирование и четкое выделение всей логики в максимально обобщенную структуру данных. 
        
		Не забудьте протестировать вашу реализацию. Дополнительно, необходимо провести [стресс-тестирование](https://en.wikipedia.org/wiki/Stress_testing) — проверить ваш сервис на большом объеме данных.
        
		Для решения этой задачи может пригодиться Для реализация выталкивания слов следует использовать [LRU](http://habrahabr.ru/post/136758/), который можно реализовать с помощью двух предыдущих структур данных.
		*/
	}
}