using uLearn;

namespace OOP.Slides.U03_DataStructure
{
    [Slide("Задача. Сервис автодополнения", "{2315E50E-3EA0-4943-8113-E6025325EFA0}")]
    public class S060_LimitedAutocompleteService
    {
        /*
        Данная задача является обязательной.
        
        Необходимо реализовать сервис со следующими возможностями:
        * Ввести очередное слово.
        * Среди последних 10 000 уникальных введенных слов, показать любые 10, которые начинаются на заданный префикс.
        
        От сервиса мы хотим понятный интерфейс, логгирование и четкое выделение всей хитрой логики в максимально обобщенную структуру данных. 
        
        Не забудьте протестировать вашу реализацию. Дополнительно, необходимо проверить ваш сервис на большом объеме данных - провести стресс-тестирование(https://en.wikipedia.org/wiki/Stress_testing).
        
        Hint: Для реализация выталкивания слов следует использовать LRU(http://habrahabr.ru/post/136758/), который можно реализовать с помощью двух предыдущих структур данных.
        */
    }
}