using uLearn;

namespace OOP.Slides.U03_DataStructure
{
	[Slide("Задача. Сервис автодополнения", "{2315E50E-3EA0-4943-8113-E6025325EFA0}")]
	public class S060_LimitedAutocompleteService
	{
		/*
		Реализуйте эффективно сервис со следующими возможностями:

		* Ввести очередное слово.
		* Среди последних 10 000 _уникальных_ введенных слов, показать любые 10, которые начинаются на заданного префикса.

		Сервис должен быть отдельным классом с понятным интерфейсом, встроенным логгированием операций.
		Вся логика должна быть выделена в отдельную максимально обобщенную структуру данных, без логгирования.

		Не забудьте протестировать вашу реализацию. В частности, не забудьте про тестирование на больших объемах — вы должны продемонстрировать, что ваша реализация работает эффективно.

		Для эффективной реализации вам пригодится алгоритм [LRU](http://habrahabr.ru/post/136758/).
		При его реализации используйте написанные вами в предыдущих задачах структуры данных.
		*/
	}
}