using System;
using System.Collections.Generic;
using uLearn.CSharp;

namespace uLearn.Courses.BasicProgramming.Slides
{
	[Slide("Шифр незнакомки", "{673C8A47-9560-4458-9BD9-A0C0B58466AA}")]
	public class S011_ListTask
	{
		/*
		Вася этим летом отдыхал на море и встретил таинственную незнакомку, которая передала ему крайне странную записку.

			решИла нЕ Упрощать и зашифРОВАтЬ Все послаНИЕ
			дАже не Старайся нИЧЕГО у тЕбя нЕ получится с расшифРОВкой
			Сдавайся НЕ твоего ума Ты не споСОбЕн Но может быть
			если особенно упорно подойдешь к делу
				
			будет Трудно конечнО
			Код ведЬ не из простых
			очень ХОРОШИЙ код
			то у тебя все получится
			и я буДу Писать тЕбЕ ещё

			чао

		Вася долго лежал на пляже, пытаясь понять, что бы это значило. 
		Дошло до того, что он перегрелся на солнце и у него закружилась голова, но как раз благодаря этому он и понял как разгадать шифр:
		
		Нужно выписать все слова, начинающиеся с большой буквы, в порядке, обратном тому, как они встречались в тексте.

		Вася все ещё надеется, что незнакомка пришлет ему ещё одно послание.
		А чтобы приготовиться к этому моменту, решил написать программу, расшифровывающую её шифр.
		*/

		[Hint("Для разбиения строки на слова, можно использовать функцию `string.Split(' ', s)`")]
		[Hint("Вы можете проверить, является ли символ заглавным с помощью `Char.IsLower`")]
		[ExpectedOutput("Писать ХОРОШИЙ Код Трудно Но Ты НЕ Сдавайся Старайся Все Упрощать")]
		[HideOnSlide]
		public static void Main()
		{
			string[] text = LoadText();
			Console.WriteLine(DecodeMessage(text));
		}

		[Exercise]
		private static string DecodeMessage(string[] lines)
		{
			var words = new List<String>();
			foreach (var line in lines)
			{
				foreach (var word in line.Split(' '))
				{
					if (word.Length != 0 && Char.IsUpper(word[0]))
						words.Add(word);
				}
			}
			words.Reverse();
			return string.Join(" ", words.ToArray());
		}

		[HideOnSlide]
		public static string[] LoadText()
		{
			return new[]
			{
				"решИла нЕ Упрощать и зашифРОВАтЬ Все послаНИЕ",
				"дАже не Старайся нИЧЕГО у тЕбя нЕ получится с расшифРОВкой",
				"Сдавайся НЕ твоего ума Ты не споСОбЕн Но может быть",
				"если особенно упорно подойдешь к делу",
				"",
				"будет Трудно конечнО",
				"Код ведЬ не из простых",
				"очень ХОРОШИЙ код",
				"то у тебя все получится",
				"и я буДу Писать тЕбЕ ещё",
				"",
				"чао",
			};
		}
	}
}
