using uLearn;

namespace OOP.Slides.U00_Intro
{
	[Slide("Введение", "{4D47FD8D-68FE-4397-98CF-2ECF7FC7A53E}")]
	public class S000_Intro
	{
		/*
		Основополагающей концепцией в ООП является понятие __класса__.

		В этом курсе-практикуме вы познакомитесь с различными взглядами на класс.
		
		Вы познакомитесь с несколькими типичными способами организации классов: класс, как тип данных; класс, реализация алгоритма; класс, структура данных; класс, сервис.

		Задачи этого курса должны пополнить ваш внутреннюю копилку известных хороших способов детального проектирования программ.
		В дальнейшей вашей работе, при проектировании компонентов программных систем, вы сможете лучше видеть разнообразие возможностей декомпозиции компоненты на классы.

		Каждый следующий модуль будет содержать краткую теорию и задачу, разбитую на несколько последовательных шагов.
		*/
	}
}