using uLearn;

namespace OOP.Slides.U00_Intro
{
	[Slide("Введение", "{4D47FD8D-68FE-4397-98CF-2ECF7FC7A53E}")]
	public class S000_Intro
	{
		/*
		В этом практикуме предполагается, что вы уже знакомы с основами языкa Java.

		Основополагающей концепцией ООП является понятие **класса**.

		Класс — довольно универсальное выразительное средство объектно-ориентированных языков.

		Класс может использоваться для моделирования новых типов данных. Может — для реализации алгоритма.
		С помощью классов удобно оформлять коллекции и структуры данных.
		Серверные программы обычно принято бить на классы-сервисы.
		Часто применяются классы стратегии и классы фабрики.

		У каждого перечисленного случая есть свои области применения и свои принятые практики реализации таких классов.
		Знакомство с особенностями различных проявлений классов чрезвычайно полезно при детальном проектировании больших программ.

		Всему этому и посвящен этот курс-практикум.
	
		Курс состоит из нескольких модулей.
		Каждый модуль содержит краткую теорию и задачу, разбитую на несколько последовательных шагов.

		Предполагается, что более глубокое знакомство с теорией вы получите на лекциях или в ходе самостоятельного изучения материала.
		Данный практикум же сконцентрирован именно на задачах.

		Каждый следующий модуль будет содержать краткую теорию и задачу, разбитую на несколько последовательных шагов.

		Именно эти задачи и будут оцениваться на компьютерных практиках. 
		Не обязательно выполнять все шаги перед тем, как показывать решение преподавателю. 
		Наоборот, рекомендуется сдавать ваши решения по шагам.
		*/
	}
}