using uLearn;

namespace OOP.Slides.U00_Intro
{
	[Slide("Формат курса", "{8870D20A-1AEE-46C3-A4F1-17EB9AD209FE}")]
	public class S005_CourseFormat
	{
		/*
		Курс состоит из нескольких модулей.
		Каждый модуль содержит краткую теорию и задачу, разбитую на несколько последовательных шагов.

		Именно эти задачи и будут оцениваться на компьютерных практиках. 
		Не обязательно выполнять все шаги перед тем, как показывать решение преподавателю. 
		Наоборот, рекомендуется сдавать ваши решения по шагам.

		Предполагается, что более глубокое знакомство с теорией вы получите на сопутствующих лекциях или в ходе самостоятельного изучения материала.
		Данный практикум же сконцентрирован именно на задачах.
		*/
	}
}