namespace uLearn.Courses.BasicProgramming.Slides.U07_Complexity
{
	[Slide("Практика", "{3EB365BD-3F58-44A8-B4E2-AB6EF8925D58}")]
	public class S099_Exercise
	{
		/*
 		Обработка изображений
		---

		Этот блок задач взят (почти) из реальной жизни.
		Несколько лет назад команда AIRLabs впервые приняла участие в соревнованиях Eurobot — международных соревнованиях по робототехнике.
		Тогда у нее еще не было ни акселерометров, ни гироскопов, ни даже энкодеров, и после 5 секунд движения робот не знал, где он находится: 
		ведь, когда вы говорите двигателю ехать со скоростью V, он едет с какой угодно скоростью, но только не с V.

		Основную проблему представляет угловая погрешность. Если вы проехали 11 сантиметров вместо 10 — это не страшно. 
		Но если вы ошиблись в угле градусов на 10, то вы едете в никуда. 
		
		К счастью, на поле были начерчены синие и красные квадраты, как на шахматной доске. 
		Соответственно, можно было посмотреть на поле с помощью камеры, и определить свой текущий угол. 
		Именно это мы в итоге и сделали, а теперь предлагаем вам.

		Откройте Image.csproj и решите поставленные в Tasks.cs задачи.

		[Скачать проект Image](image.zip)
		*/
	}
}