// Таким образом вы подключаете пространство имен System к вашему кодовому файлу 
// (не к всему проекту! Это не Reference!)
using System;

//Таким образом вы определяете свое пространство имен.
namespace Lectures
{
	// Таким образом определяется класс.
	class Program
	{
		/*
		 * static - некое волшебное слово, смысл которого будет ясен позднее.
		 * void Main() определяет метод.
		 * Из-за своего названия Main является точкой входа — это метод, 
		 * который будет запущен при выполнении программы.
		 */
		static void Main()
		{
			// Этот код выводит на экран строку
			// Console — это класс, также как Program, определенный в пространстве имен System.
			Console.WriteLine("Hello, world!");
		}
	}
}
