namespace uLearn.Courses.BasicProgramming.Slides
{
	[Slide("Hello world", "{7FB8D0CC-B551-485B-8D0B-37993D1B4B08}")]
	public class S01_HelloWorld
	{
		//#video //www.youtube.com/embed/81Ub0SMxZQo?rel=0

		/*
		## Краткие заметки по лекции

		Студенты УрФУ могут бесплатно получить Visual Studio через [Microsoft DreamSpark](http://dreamspark.ru)

		Вы также можете использовать [Xamarin Studio](http://xamarin.com) - альтернативную среду разработки на C#. 
		В отличие от Visual Studio, Xamarin работает и с другими операционными системами.
		
		Программы под .NET, благодаря технологии mono, запускаются под Linux и OSX, а также на мобильных устройствах.
		
		Кодовый файл — это один из файлов на языке C#.

		Проект — это совокупность кодовых файлов, которые могут быть скомпилированы в сборку: программу или библиотеку

		Решение (solution) — это несколько проектов, объединенные общими библиотеками и задачами

		Reference — ссылка внутри проекта на другие сборки, которые позволяют использовать сторонний код
		
		Метод — это последовательность действий.

		Класс — это совокупность данных и методов. Все сборки состоят из скомпилированных классов.

		Пространство имен — это совокупность классов, логически связанных между собой. 
		
		Между сборками и пространствами имен нет прямого соответствия: в сборке может хранится несколько пространств имен, 
		а разные классы одного пространства имен могут быть определены в разных сборках.
		*/

		//#include U01_Basics._HelloWorld.cs
	}
}