using System;

namespace uLearn.Courses.BasicProgramming.Slides
{
	[Title("Первый шаг")]
	public class S011_FirstStep
	{

		/*
		Любая, даже самая сложная дорога, начинается с первого шага.

		Выведите на консоль фразу ```The first step!```
		*/

		[Exercise]
		[ExpectedOutput("The first step!")]
		[Hint("Вывод на консоль производится методом ```Console.WriteLine```")]
		static public void Main()
		{
			Console.WriteLine("The first step!");
			/*uncomment
			// пишите код тут
			*/
		}
	}

	
}
