using System;
using uLearn.CSharp;

namespace uLearn.Courses.BasicProgramming.Slides
{
	[Slide("Источники информации", "{a36a9029-b83f-436e-a2b9-81e519d9a32d}")]
	public class S012_InformationSources
	{
		/*
		В сети есть большое количество источников информации по платформе .NET и языку C#. 
		Большая часть этой информации на английском.

		Microsoft перевела на русский [Руководство по программированию на C#](http://msdn.microsoft.com/ru-ru/library/67ef8sbd.aspx).

		Однако настоящим первоисточником по языку C# является [Спецификация C#](http://www.microsoft.com/en-us/download/details.aspx?id=7029).
		Первый раздел этой спецификации Introduction содержит всего 30 страниц, 
		легко читается и дает достаточно хорошее представление о всех возможностях языка.
		В следующих разделах каждая возможность описывается максимально полно, строго и формально, с разбором частных случаев.
		Вы можете обращаться к этим разделам, если хотите глубже разобраться в каких-либо возможностях языка.

		*/
	}

	
}
