using System;
using System.Drawing;
using uLearn;

namespace OOP.Slides.U10_NoIfs
{
	[Slide("Лесные жители", "077B49E03DF64A0E8D385770AA7FD2ED")]
	public class S020_Wood
	{
		/*
		Дальше вас ждет серия задач на одном проекте "Лесные жители".

		В лесу живут лесные жители. Лес — это прямоугольный клеточный мир, заданный в таком формате.

			111111111
			1000001K1
			111110101
			100010101
			101000101
			101111101
			1000000L1
			111111111

		где 

		* 0 - тропинка. Лесные жители могут передвигаться по тропинкам.
		* 1 - заросли. По зарослям передвигаться не могут.
		* K - капкан. При попадании на капкан у лесного жителя уменьшается количество жизней.
		* L - жизнь на тропинке. При попадании на эту ячейку у лесного жителя увеличивается количество жизней на 1, а ячейка превращается в тропинку.
		*/
	}
}