using uLearn;

namespace OOP.Slides.U10_NoIfs
{
	[Slide("Задача: Основа", "56767FC1-FD3D-4E4B-8BD5-D77943E6A104")]
	public class S030_Основа
	{
		/*
		В этой задаче запрещено использовать конструкции `if`, `switch` и `: ?`. Используйте вместо этого полиморфизм.

		Спроектируйте интерфейсы и классы, описывающие состояние леса, лесного жителя.

		В классе леса должно быть два метода:

		* Помещение нового лесного жителя в некоторую точку леса.
		* Движение лесного жителя в заданном направлении.
		Этот метод должен проверять допустимость этого передвижения, обрабатывать все последствия и возвращать результат — получилось или не получилось.

		Создайте отдельный класс загрузчика леса из файла в описанном ранее формате.

		Создайте модульные тесты, проверяющие логику работы леса и загрузчика.
		*/
	}
}