using uLearn;

namespace OOP.Slides.U13_Threading
{
	[Slide("Задача: Thread-safety", "2C54C6E7F7B64C56ACE2FE3B953F8C26")]
	public class S010_ThreadSafety
	{

		/*
		Создайте структуру данных, хранящую упорядоченный набор строк с такой операцией 
		
		`Tuple<int, string> ReplaceFirst(word, replace)` 
		
		со следующим смыслом: найти первую строку, в которой встречается слово word и заменить первое его вхождение на replace 
		и вернуть пару — номер измененной строки и строку после изменения.
		Если вхождений word нет, то вернуть null.

		Структура данных должна иметь конструктор из массива строк.

		Создайте наивную, потоконебезопасную реализацию и тест, показывающий ее неработоспособность.

		Создайте потокобезопасную реализацию и тест, показывающий ее работоспособность.

		Ещё один тест должен сравнить производительность работы с этой структурой данных в один поток и в несколько потоков. 
		Получается ли выигрыш от работы в несколько потоков?

		*/
	}
}