using uLearn;

namespace OOP.Slides.U13_Threading
{
	[Slide("Задача: Сервер", "3A18F9B86EBC4E7A9D1A8A1E177AAFF4")]
	public class S020_Server
	{

		/*
		Создайте Http сервер, обрабатывающий один запрос ReplaceFirst к структуре данных из предыдущей задачи.

		Для создания сервера можно использовать класс HttpListener.

		Создайте три реализации:
		
		* однопоточный сервер;
		* сервер, создающий на каждый запрос по новому потоку (`new Thread(...).Start()`)
		* сервер, создающий на каждый запрос задачу для пула потоков (`Task.Factory.StartNew(...)`);

		Протестируйте их работоспособность с помощью любимого браузера.

		*/
	}
}