namespace uLearn.Courses.BasicProgramming.Slides.U02_Ifs
{
	[Slide("Практика", "{21FF04E0-EF4F-4F24-AF59-B637A8394901}")]
	class S099_Exercise
	{
		/*
		[Скачать проекты с задачами](https://github.com/urfu-code/cs101-02-ifs/archive/master.zip)

		## Два прямоугольника

		Вам даны два прямоугольника на плоскости, со сторонами параллельными осям координат. Пересекаются ли они? Площадь пересечения? Вложен ли один в другой? 

		Реализуйте соответствующие функции в классе RectangleTasks.cs проекта Rectangles. 
		Решите задание без использования библиотечных функций, кроме Min и Max. 

		## Расстояние до фигуры

		Проект Distance. Реализуйте функцию расчета расстояния от точки до границы заданной  фигуры.
		Координаты основных точек фигуры вы сможете найти где-то в исходниках проекта. Учитесь изучать чужой код!


		## Рубль -лей -ля

		Проект Pluralize. 
		Нужно просклонять существительное "рублей" следующее за числительным. Например, 10 рублей, 1 рубль, 2 рубля.


		## 20 постов, 31 лайк и 2 котика

		Представьте, что вы пишите программу, в интерфейсе, которой есть посты, лайки, котики и еще с десяток слов, которые нужно уметь склонять.
		Придумайте как можно обобщить этот алгоритм, чтобы не приходилось реализовывать его для каждого слова заново.

		Реализуйте придуманный алгоритм в отдельном проекте.
		*/
	}
}
