using uLearn;

namespace OOP.Slides.U12_Network
{
	[Slide("Сетевая игра", "FD6090E4DE89497FB9C1C191598DF2D1")]
	public class S010_Network
	{

		/*
		Вам предстоит разделить ваш проект на серверную и клиентские части.

		Сервер — отдельная исполняемая программа, которая выполняет всю игровую логику, кроме искусственного интеллекта, и не имеет пользовательского интерфейса.
		Сервер принимает подключение по TCP с клиентами двух типов — клиент-игрок и клиент-визуализатор.
		Настройки игры — карта, начальная и финальная позиции лесного жителя и другие необходимые параметры сервер читает из конфигурационного
		файла при старте.
		
		Клиент-игрок — исполняемая программа, которая выполняет логику искусственного интеллекта и не имеет пользовательского интерфейса.

		Клиент-визуализатор — исполняемая программа, которая подключается к серверу 
		и отображает в пользовательском интерфейсе текущее состояние игрового мира.
		*/
	}
}