using uLearn;

namespace OOP.Slides.U12_Network
{
	[Slide("Задача: Конфиг-файл", "5B3E4FD89E5E4778A7603F6861320990")]
	public class S040_Config
	{
		/*
		Реализуйте загрузку конфиг-файла с настройками сервера.

		Для этого выберите формат и библиотеку сериализации для загрузки конфиг-файла.
		
		В этой задаче запрещено реализовывать разбор конфигурационного файла вручную. 
		Воспользуйтесь одним из уже готовых способов десериализации из форматов Xml, Json или любого другого человеко-читаемого формата.
		
		*/
	}
}